
// BSLLS:NestedFunctionInParameters-off - без лишних переменных выполнение быстрее
// BSLLS:EmptyRegion-off - пустые области разрешены

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
//Возвращает ссылку на копию Шаблона справочника
//При этом копируются элементы подчиненных справочников
//Родителем копии будет являться элемент обозначающий месяц переданной даты
//АРГУМЕНТЫ:
//    Ссылка (СправочникСсылка) - Ссылка на копируемый элемент
//	  Наименование(Строка) - Наименование нового элемента справочника
//	  Дата (Дата) - Предполагаемая дата этапа	
Функция КопироватьШаблонСправочника(Ссылка, Наименование, Дата) Экспорт
	
	ЭтапГод = Строка(Формат(Дата,"ДФ=гггг"));
	ЭтапМесяц = Строка(Формат(Дата,"ДФ=ММММ"));
	
	ЭлементГод = Справочники.ЭтапыПроекта.НайтиПоНаименованию(ЭтапГод, , , );
	Если ЭлементГод.Пустая() Тогда
		ЭлементГод = Справочники.ЭтапыПроекта.СоздатьЭлемент();
		ЭлементГод.Наименование = ЭтапГод;
		ЭлементГод.Записать();
	КонецЕсли;
	
	ЭлементМесяц = Справочники.ЭтапыПроекта.НайтиПоНаименованию(ЭтапМесяц, ,ЭлементГод , );
	Если ЭлементМесяц.Пустая() Тогда
		ЭлементМесяц = Справочники.ЭтапыПроекта.СоздатьЭлемент();
		ЭлементМесяц.Наименование = ЭтапМесяц;
		ЭлементМесяц.Родитель = ЭлементГод;
		ЭлементМесяц.Записать();
	КонецЕсли;
	
	ТзРодитель = Новый ТаблицаЗначений;
	ТзРодитель.Колонки.Добавить("Старый");
	ТзРодитель.Колонки.Добавить("Новый");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыПроекта.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
		|ГДЕ
		|	ЭтапыПроекта.Ссылка В ИЕРАРХИИ (&Ссылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ТзРодитель.Добавить();
		Элемент = ВыборкаДетальныеЗаписи.Ссылка;
		СтрокаРодитель = ТзРодитель.Найти(Элемент.Родитель, "Старый"); 
		
		Если НЕ ВыборкаДетальныеЗаписи.Ссылка = Ссылка Тогда 
			
			НовыйЭлемент = Элемент.Скопировать();
			НовыйЭлемент.Родитель = СтрокаРодитель.Новый.Ссылка;
			НовыйЭлемент.Записать();
		Иначе 
			НовыйЭлемент = Элемент.Скопировать();
			НовыйЭлемент.Наименование = Наименование;
			НовыйЭлемент.Родитель = ЭлементМесяц;
			НовыйЭлемент.Записать(); 
			
		КонецЕсли;
		
		НоваяСтрока.Старый = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.Новый = НовыйЭлемент;
		
	КонецЦикла;
	
	ЭлементНовыйКоренной = ТзРодитель[0].Новый.Ссылка;
	
	Возврат ЭлементНовыйКоренной;
	
КонецФункции

//Возвращает ссылку на копию элемента справочника
//При этом копируются элементы подчиненных справочников
//Родителем копии будет являться Ссылка.Родитель
//АРГУМЕНТЫ:
//    Ссылка (СправочникСсылка) - Ссылка на копируемый элемент
//	  Наименование(Строка) - Наименование нового элемента справочника
Функция КопироватьЭлементСправочника(Ссылка, Наименование = "") Экспорт
	
	Если ПустаяСтрока(Наименование) Тогда
		
		Наименование = Ссылка.Наименование;
		
	КонецЕсли;
	
	ТзРодитель = Новый ТаблицаЗначений;
	ТзРодитель.Колонки.Добавить("Старый");
	ТзРодитель.Колонки.Добавить("Новый");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыПроекта.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
		|ГДЕ
		|	ЭтапыПроекта.Ссылка В ИЕРАРХИИ (&Ссылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ТзРодитель.Добавить();
		Элемент = ВыборкаДетальныеЗаписи.Ссылка;
		СтрокаРодитель = ТзРодитель.Найти(Элемент.Родитель, "Старый"); 
		
		Если НЕ ВыборкаДетальныеЗаписи.Ссылка = Ссылка Тогда 
			
			НовыйЭлемент = Элемент.Скопировать();
			НовыйЭлемент.Родитель = СтрокаРодитель.Новый.Ссылка;
			НовыйЭлемент.Записать();
		Иначе 
			НовыйЭлемент = Элемент.Скопировать();
			НовыйЭлемент.Наименование = Наименование;
			НовыйЭлемент.Родитель = Ссылка.Родитель;
			НовыйЭлемент.Записать(); 
			
		КонецЕсли;
		
		НоваяСтрока.Старый = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.Новый = НовыйЭлемент;
		
	КонецЦикла;
	
	ЭлементНовыйКоренной = ТзРодитель[0].Новый.Ссылка;
	
	Возврат ЭлементНовыйКоренной;
	
КонецФункции

//Возвращает ссылку на копию элемента справочника
//АРГУМЕНТЫ:
//    Тип (Перечисления.ТипЭтапа) - Перечисление ТипЭтапа
//	  Наименование(Строка) - Наименование нового элемента справочника
//	  Родитель(Справочник.Ссылка) - Ссылка на родительский элемент справочника
Функция СоздатьЭлементСправочника(Тип, Наименование, Родитель) Экспорт
	
	ТаблицаДействий = ПолучитьДействия(Тип);
	
	НовыйЭлемент = Справочники.ЭтапыПроекта.СоздатьЭлемент();
	НовыйЭЛемент.ТипЭтапа = Тип;
	НовыйЭлемент.Наименование = Наименование;
	НовыйЭлемент.Родитель = Родитель;
	НовыйЭлемент.ТЧДействия.Загрузить(ТаблицаДействий);
	НовыйЭлемент.Записать();

	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции
//Возвращает макет области
//АРГУМЕНТЫ:
//    СсылкаНаЭтапПроекта (Справочник.ТипСсылка) - Элемент справочника
//Тест
Функция ПолучитьПечатнуюФорму(СсылкаНаЭтапПроекта) Экспорт
	
	ТипЭтапа = СсылкаНаЭтапПроекта.ТипЭтапа;
	
	Если ТипЭтапа = Перечисления.ТипЭтапа.Задачи 
	Или 
		ТипЭтапа = Перечисления.ТипЭтапа.ОбработаннаяРасшифровка
	Или 
		ТипЭтапа = Перечисления.ТипЭтапа.Протокол 
	Или 
		ТипЭтапа = Перечисления.ТипЭтапа.РасшифровкаВидео
	Или 
		ТипЭтапа = Перечисления.ТипЭтапа.Текст Тогда

		Макет =  ПолучитьМакет("Текст");

	ИначеЕсли ТипЭтапа = Перечисления.ТипЭтапа.Видео Тогда

		Макет = ПолучитьМакет("Видео");

	ИначеЕсли ТипЭтапа = Перечисления.ТипЭтапа.Обсуждение Тогда

		Макет =  ПолучитьМакет("Таблица");

	КонецЕсли;
	
	Возврат Макет;

КонецФункции
//Возвращает таблицу
Функция ПолучитьДействия(ЭтапПроекта) Экспорт

	ТаблицаДействия = Новый ТаблицаЗначений;
	ТаблицаДействия.Колонки.Добавить("ИмяДействия");
	ТаблицаДействия.Колонки.Добавить("ОбработчикДействия");
	ТаблицаДействия.Колонки.Добавить("ПредставлениеДействия");

	стр = ТаблицаДействия.Добавить();
	стр.ИмяДействия = "ИзменитьДанные"; //автоматом при изменении
	стр.ОбработчикДействия = "ИзменитьДанные";
	стр.ПредставлениеДействия = "Изменить данные";

	Если ЭтапПроекта = Перечисления.ТипЭтапа.Видео Тогда

		стр = ТаблицаДействия.Добавить();
		стр.ИмяДействия = "КнопкаДействияРасшифровкаВидео";
		стр.ОбработчикДействия = "РасшифроватьВидео";
		стр.ПредставлениеДействия = "Расшифровать видео";

	ИначеЕсли ЭтапПроекта = Перечисления.ТипЭтапа.Текст 
		Или 
			ЭтапПроекта = Перечисления.ТипЭтапа.Задачи 
		Или 
			ЭтапПроекта	= Перечисления.ТипЭтапа.Протокол 
		Или 
			ЭтапПроекта = Перечисления.ТипЭтапа.Текст Тогда

		стр = ТаблицаДействия.Добавить();
		стр.ИмяДействия = "КнопкаОтменитьДанне";  //кнопка очищает поле
		стр.ОбработчикДействия = "ОтменитьДанные";
		стр.ПредставлениеДействия = "Отменить данные";

		стр = ТаблицаДействия.Добавить();
		стр.ИмяДействия = "КнопкаУдалитьДанные";  // помечает на удаление (текущий) элемент справочника
		стр.ОбработчикДействия = "УдалитьДанные";
		стр.ПредставлениеДействия = "Удалить данные";
		
	ИначеЕсли ЭтапПроекта = Перечисления.ТипЭтапа.Обсуждение Тогда	

		стр = ТаблицаДействия.Добавить();
		стр.ИмяДействия = "КнопкаДобавитьСтолбец";
		стр.ОбработчикДействия = "ДобавитьСтолбец";
		стр.ПредставлениеДействия = "Добавить столбец";

		стр = ТаблицаДействия.Добавить();
		стр.ИмяДействия = "КнопкаДобавитьСтроку";
		стр.ОбработчикДействия = "ДобавитьСтроку";
		стр.ПредставлениеДействия = "Добавить строку";

		стр = ТаблицаДействия.Добавить();
		стр.ИмяДействия = "КнопкаУдалитьСтолбец";
		стр.ОбработчикДействия = "УдалитьСтолбец";
		стр.ПредставлениеДействия = "Удалить столбец";

		стр = ТаблицаДействия.Добавить();
		стр.ИмяДействия = "КнопкаУдалитьСтроку";
		стр.ОбработчикДействия = "УдалитьСтроку";
		стр.ПредставлениеДействия = "Удалить строку";

	КонецЕсли;

	Возврат ТаблицаДействия;
	
КонецФункции

функция ВыполнитьДействие(ЭтапПроекта, Действие, Данные) Экспорт
	
	ВыполненоУспешно = неопределено;
	
	Попытка             
		
		Если Действие = "КнопкаДействияРасшифровкаВидео" и ЭтапПроекта = Перечисления.ТипЭтапа.Видео Тогда 
			
			Выполнить("РасшифроватьВидео(Данные)");
			ВыполненоУспешно = Истина;
			
		КонецЕсли;      
		
	Исключение
		
		ВыполненоУспешно = Ложь;
		
	КонецПопытки;
		
	Возврат ВыполненоУспешно;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСВидео

Процедура РасшифроватьВидео(Объект)  

	
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("Родитель",Объект.Ссылка); 
	Запрос.УстановитьПараметр("ТипЭтапа",Перечисления.ТипЭтапа.РасшифровкаВидео);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапыПроекта.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
	               |ГДЕ
	               |	ЭтапыПроекта.Родитель = &Родитель
	               |	И ЭтапыПроекта.ТипЭтапа = &ТипЭтапа";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		РасшифровкаВидеоОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
	Иначе
		
		РасшифровкаВидеоОбъект = Справочники.ЭтапыПроекта.СоздатьЭлемент();
		РасшифровкаВидеоОбъект.Родитель = Объект.Ссылка; 
		РасшифровкаВидеоОбъект.Наименование = "РасшифровкаВидео";
		РасшифровкаВидеоОбъект.Файл = Объект.Файл;
		РасшифровкаВидеоОбъект.ТипЭтапа = Перечисления.ТипЭтапа.РасшифровкаВидео;
		
	КонецЕсли;
	
	РасшифровкаВидеоОбъект.Текст = РасшифроватьВидеоСервер.ПолучитьРасшифровкуВидео();
	РасшифровкаВидеоОбъект.Записать();   
	
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("Родитель",РасшифровкаВидеоОбъект.Ссылка); 
	Запрос.УстановитьПараметр("ТипЭтапа",Перечисления.ТипЭтапа.ОбработаннаяРасшифровка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапыПроекта.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
	               |ГДЕ
	               |	ЭтапыПроекта.Родитель = &Родитель
	               |	И ЭтапыПроекта.ТипЭтапа = &ТипЭтапа";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если не Выборка.Следующий() Тогда
		
		ОбработаннаяРасшифровкаОбъект = Справочники.ЭтапыПроекта.СоздатьЭлемент();
		ОбработаннаяРасшифровкаОбъект.Родитель = РасшифровкаВидеоОбъект.Ссылка;  
		ОбработаннаяРасшифровкаОбъект.Файл = Объект.Файл;   
		ОбработаннаяРасшифровкаОбъект.Наименование = "ОбработаннаяРасшифровка";
		ОбработаннаяРасшифровкаОбъект.ТипЭтапа = Перечисления.ТипЭтапа.ОбработаннаяРасшифровка;
		
		ОбработаннаяРасшифровкаОбъект.Записать();
			
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти 

#Область Печать

#КонецОбласти
	
#КонецЕсли

// BSLLS:NestedFunctionInParameters-on
// BSLLS:EmptyRegion-on
