#Область ОбщаяОбласть
//Возвращает ссылку на копию элемента справочника
//При этом копируются элементы подчиненных справочников
//Родителем копии будет являться элемент обозначающий месяц переданной даты
//АРГУМЕНТЫ:
//    Ссылка (СправочникСсылка) - Ссылка на копируемый элемент
//	  Наименование(Строка) - Наименование нового элемента справочника
//	  Дата (Дата) - Предполагаемая дата этапа	
Функция КопироватьЭлементСправочника(Ссылка,Наименование, Дата) Экспорт
	
	ЭтапГод = Строка(Год(Дата));
	ЭтапМесяц = Строка(Месяц(Дата));
	
	ЭлементГод = Справочники.ЭтапыПроекта.НайтиПоНаименованию(ЭтапГод, , , );
	Если ЭлементГод = Неопределено Тогда
		ЭлементГод = Справочники.ЭтапыПроекта.СоздатьЭлемент();
		ЭлементГод.Наименование = ЭтапГод;
		ЭлементГод.Записать();
	КонецЕсли;
	
	ЭлементМесяц = Справочники.ЭтапыПроекта.НайтиПоНаименованию(ЭтапМесяц, ,ЭлементГод , );
	Если ЭлементМесяц = Неопределено Тогда
		ЭлементМесяц = Справочники.ЭтапыПроекта.СоздатьЭлемент();
		ЭлементМесяц.Наименование = ЭтапМесяц;
		ЭлементМесяц.Родитель = ЭлементГод;
		ЭлементМесяц.Записать();
	КонецЕсли;
	
	ТзРодитель = Новый ТаблицаЗначений;
	ТзРодитель.Колонки.Добавить("Старый");
	ТзРодитель.Колонки.Добавить("Новый");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыПроекта.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
		|ГДЕ
		|	ЭтапыПроекта.Ссылка В ИЕРАРХИИ (&Ссылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ТзРодитель.Добавить();
		Элемент = ВыборкаДетальныеЗаписи.Ссылка;
		СтрокаРодитель = ТзРодитель.Найти(Элемент.Родитель, "Старый"); 
		
		Если НЕ ВыборкаДетальныеЗаписи.Ссылка = Ссылка Тогда 
			
			НовыйЭлемент = Элемент.Скопировать();
			НовыйЭлемент.Родитель = СтрокаРодитель.Новый.Ссылка;
			НовыйЭлемент.Записать();
		Иначе 
			НовыйЭлемент = Элемент.Скопировать();
			НовыйЭлемент.Наименование = Наименование;
			НовыйЭлемент.Родитель = ЭлементМесяц;
			НовыйЭлемент.Записать(); 
			
		КонецЕсли;
		
		НоваяСтрока.Старый = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.Новый = НовыйЭлемент;
		
	КонецЦикла;
	
	ЭлементНовыйКоренной = ТзРодитель[0].Новый;
	
	Возврат ЭлементНовыйКоренной;
	
КонецФункции

#КонецОбласти
