// BSLLS:NestedFunctionInParameters-off - без лишних переменных выполнение быстрее
// BSLLS:EmptyRegion-off - пустые области разрешены

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
//Возвращает ссылку на копию Шаблона справочника
//При этом копируются элементы подчиненных справочников
//Родителем копии будет являться элемент обозначающий месяц переданной даты
//АРГУМЕНТЫ:
//    Ссылка (СправочникСсылка) - Ссылка на копируемый элемент
//	  Наименование(Строка) - Наименование нового элемента справочника
//	  Дата (Дата) - Предполагаемая дата этапа	
Функция КопироватьШаблонСправочника(Ссылка, Наименование, Дата) Экспорт
	
	ЭтапГод = Строка(Формат(Дата,"ДФ=гггг"));
	ЭтапМесяц = Строка(Формат(Дата,"ДФ=ММММ"));
	
	ЭлементГод = Справочники.ЭтапыПроекта.НайтиПоНаименованию(ЭтапГод, , , );
	Если ЭлементГод.Пустая() Тогда
		ЭлементГод = Справочники.ЭтапыПроекта.СоздатьЭлемент();
		ЭлементГод.Наименование = ЭтапГод;
		ЭлементГод.Записать();
	КонецЕсли;
	
	ЭлементМесяц = Справочники.ЭтапыПроекта.НайтиПоНаименованию(ЭтапМесяц, ,ЭлементГод , );
	Если ЭлементМесяц.Пустая() Тогда
		ЭлементМесяц = Справочники.ЭтапыПроекта.СоздатьЭлемент();
		ЭлементМесяц.Наименование = ЭтапМесяц;
		ЭлементМесяц.Родитель = ЭлементГод;
		ЭлементМесяц.Записать();
	КонецЕсли;
	
	ТзРодитель = Новый ТаблицаЗначений;
	ТзРодитель.Колонки.Добавить("Старый");
	ТзРодитель.Колонки.Добавить("Новый");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыПроекта.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
		|ГДЕ
		|	ЭтапыПроекта.Ссылка В ИЕРАРХИИ (&Ссылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ТзРодитель.Добавить();
		Элемент = ВыборкаДетальныеЗаписи.Ссылка;
		СтрокаРодитель = ТзРодитель.Найти(Элемент.Родитель, "Старый"); 
		
		Если НЕ ВыборкаДетальныеЗаписи.Ссылка = Ссылка Тогда 
			
			НовыйЭлемент = Элемент.Скопировать();
			НовыйЭлемент.Родитель = СтрокаРодитель.Новый.Ссылка;
			НовыйЭлемент.Записать();
		Иначе 
			НовыйЭлемент = Элемент.Скопировать();
			НовыйЭлемент.Наименование = Наименование;
			НовыйЭлемент.Родитель = ЭлементМесяц;
			НовыйЭлемент.Записать(); 
			
		КонецЕсли;
		
		НоваяСтрока.Старый = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.Новый = НовыйЭлемент;
		
	КонецЦикла;
	
	ЭлементНовыйКоренной = ТзРодитель[0].Новый.Ссылка;
	
	Возврат ЭлементНовыйКоренной;
	
КонецФункции

//Возвращает ссылку на копию элемента справочника
//При этом копируются элементы подчиненных справочников
//Родителем копии будет являться Ссылка.Родитель
//АРГУМЕНТЫ:
//    Ссылка (СправочникСсылка) - Ссылка на копируемый элемент
//	  Наименование(Строка) - Наименование нового элемента справочника
Функция КопироватьЭлементСправочника(Ссылка, Наименование = "") Экспорт
	
	Если ПустаяСтрока(Наименование) Тогда
		
		Наименование = Ссылка.Наименование;
		
	КонецЕсли;
	
	ТзРодитель = Новый ТаблицаЗначений;
	ТзРодитель.Колонки.Добавить("Старый");
	ТзРодитель.Колонки.Добавить("Новый");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыПроекта.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
		|ГДЕ
		|	ЭтапыПроекта.Ссылка В ИЕРАРХИИ (&Ссылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ТзРодитель.Добавить();
		Элемент = ВыборкаДетальныеЗаписи.Ссылка;
		СтрокаРодитель = ТзРодитель.Найти(Элемент.Родитель, "Старый"); 
		
		Если НЕ ВыборкаДетальныеЗаписи.Ссылка = Ссылка Тогда 
			
			НовыйЭлемент = Элемент.Скопировать();
			НовыйЭлемент.Родитель = СтрокаРодитель.Новый.Ссылка;
			НовыйЭлемент.Записать();
		Иначе 
			НовыйЭлемент = Элемент.Скопировать();
			НовыйЭлемент.Наименование = Наименование;
			НовыйЭлемент.Родитель = Ссылка.Родитель;
			НовыйЭлемент.Записать(); 
			
		КонецЕсли;
		
		НоваяСтрока.Старый = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.Новый = НовыйЭлемент;
		
	КонецЦикла;
	
	ЭлементНовыйКоренной = ТзРодитель[0].Новый.Ссылка;
	
	Возврат ЭлементНовыйКоренной;
	
КонецФункции

//Возвращает ссылку на копию элемента справочника
//АРГУМЕНТЫ:
//    Тип (Перечисления.ТипЭтапа) - Перечисление ТипЭтапа
//	  Наименование(Строка) - Наименование нового элемента справочника
//	  Родитель(Справочник.Ссылка) - Ссылка на родительский элемент справочника
Функция СоздатьЭлементСправочника(Тип, Наименование, Родитель) Экспорт
	
	ТаблицаДействий = ПолучитьДействия(Тип);
	
	НовыйЭлемент = Справочники.ЭтапыПроекта.СоздатьЭлемент();
	НовыйЭЛемент.ТипЭтапа = Тип;
	НовыйЭлемент.Наименование = Наименование;
	НовыйЭлемент.Родитель = Родитель;
	НовыйЭлемент.ТЧДействия.Загрузить(ТаблицаДействий);
	НовыйЭлемент.Записать();

	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции
//Возвращает макет области
//АРГУМЕНТЫ:
//    СсылкаНаЭтапПроекта (Справочник.ТипСсылка) - Элемент справочника
//Тест
Функция ПолучитьПечатнуюФорму(СсылкаНаЭтапПроекта) Экспорт
	
	ТипЭтапа = СсылкаНаЭтапПроекта.ТипЭтапа;
	
	Если ТипЭтапа = Перечисления.ТипЭтапа.Задачи 
	Или 
		ТипЭтапа = Перечисления.ТипЭтапа.ОбработаннаяРасшифровка
	Или 
		ТипЭтапа = Перечисления.ТипЭтапа.Протокол 
	Или 
		ТипЭтапа = Перечисления.ТипЭтапа.РасшифровкаВидео
	Или 
		ТипЭтапа = Перечисления.ТипЭтапа.Текст Тогда

		Макет =  ПолучитьМакет("Текст");

	ИначеЕсли ТипЭтапа = Перечисления.ТипЭтапа.Видео Тогда

		Макет = ПолучитьМакет("Видео");

	ИначеЕсли ТипЭтапа = Перечисления.ТипЭтапа.Обсуждение Тогда

		Макет =  ПолучитьМакет("Таблица");
		
	ИначеЕсли ТипЭтапа = Перечисления.ТипЭтапа.Изображение Тогда	
		
		Макет =  ПолучитьМакет("Картинка");

	КонецЕсли;
	
	Возврат Макет;

КонецФункции
//Возвращает таблицу
Функция ПолучитьДействия(ЭтапПроекта) Экспорт

	ТаблицаДействия = Новый ТаблицаЗначений;
	ТаблицаДействия.Колонки.Добавить("ИмяДействия");
	ТаблицаДействия.Колонки.Добавить("ОбработчикДействия");
	ТаблицаДействия.Колонки.Добавить("ПредставлениеДействия");

	стр = ТаблицаДействия.Добавить();
	стр.ИмяДействия = "ИзменитьДанные"; //автоматом при изменении
	стр.ОбработчикДействия = "ИзменитьДанные";
	стр.ПредставлениеДействия = "Изменить данные";

	Если ЭтапПроекта = Перечисления.ТипЭтапа.Видео Тогда

		стр = ТаблицаДействия.Добавить();
		стр.ИмяДействия = "КнопкаДействияРасшифровкаВидео";
		стр.ОбработчикДействия = "РасшифроватьВидео";
		стр.ПредставлениеДействия = "Расшифровать видео";
		
	ИначеЕсли ЭтапПроекта = Перечисления.ТипЭтапа.Изображение Тогда
			
		стр = ТаблицаДействия.Добавить();
		стр.ИмяДействия = "КнопкаВыбратьКартнику";
		стр.ОбработчикДействия = "ВыбратьКартинку";
		стр.ПредставлениеДействия = "Выбрать картинку";	

	ИначеЕсли ЭтапПроекта = Перечисления.ТипЭтапа.Текст 
		Или 
			ЭтапПроекта = Перечисления.ТипЭтапа.Задачи 
		Или 
			ЭтапПроекта	= Перечисления.ТипЭтапа.Протокол 
		Или 
			ЭтапПроекта = Перечисления.ТипЭтапа.Текст Тогда

		стр = ТаблицаДействия.Добавить();
		стр.ИмяДействия = "КнопкаОчиститьПоле";  //кнопка очищает поле
		стр.ОбработчикДействия = "ОчиститьПоле";
		стр.ПредставлениеДействия = "Очистить поле";

		стр = ТаблицаДействия.Добавить();
		стр.ИмяДействия = "КнопкаУдалитьЭлемент";  // помечает на удаление (текущий) элемент справочника
		стр.ОбработчикДействия = "УдалитьЭлемент";
		стр.ПредставлениеДействия = "Удалить элемент";
		
	ИначеЕсли ЭтапПроекта = Перечисления.ТипЭтапа.Обсуждение Тогда	

		стр = ТаблицаДействия.Добавить();
		стр.ИмяДействия = "КнопкаДобавитьСтолбец";
		стр.ОбработчикДействия = "ДобавитьСтолбец";
		стр.ПредставлениеДействия = "Добавить столбец";

		стр = ТаблицаДействия.Добавить();
		стр.ИмяДействия = "КнопкаДобавитьСтроку";
		стр.ОбработчикДействия = "ДобавитьСтроку";
		стр.ПредставлениеДействия = "Добавить строку";

		стр = ТаблицаДействия.Добавить();
		стр.ИмяДействия = "КнопкаУдалитьСтолбец";
		стр.ОбработчикДействия = "УдалитьСтолбец";
		стр.ПредставлениеДействия = "Удалить столбец";

		стр = ТаблицаДействия.Добавить();
		стр.ИмяДействия = "КнопкаУдалитьСтроку";
		стр.ОбработчикДействия = "УдалитьСтроку";
		стр.ПредставлениеДействия = "Удалить строку";

	КонецЕсли;

	Возврат ТаблицаДействия;
	
КонецФункции

//01.04 Паранин
//Было: функция ВыполнитьДействие(ЭтапПроекта, Действие, Данные)
	//Этап проекта - ссылка на изменяемый элемент
Функция ВыполнитьДействие(ЭтапПроекта, Действие, Данные = Неопределено) Экспорт
	
	ТипЭтапа = ЭтапПроекта.ТипЭтапа;
	Объект = ЭтапПроекта.ПолучитьОбъект();
	
	ВыполненоУспешно = Ложь;
	
//	Попытка 
		
		Если Действие = "КнопкаДействияРасшифровкаВидео" И ТипЭтапа = Перечисления.ТипЭтапа.Видео Тогда

		Выполнить ("РасшифроватьВидео(Объект)");

	ИначеЕсли Действие = "КнопкаДобавитьКартинку" Тогда
			 	
		//Данные - Строка
	ИначеЕсли Действие = "КнопкаДобавитьСтолбец" Тогда

		НоваяЗапись = Объект.ТчСтруктураКолонок.Добавить();

		Если Данные = Неопределено Тогда

			Данные = "НоваяКолонка";// Возможно лучше передовать уникальное имя колонки

		КонецЕсли;

		НоваяЗапись.ИмяКолонки = Данные;
		НоваяЗапись.ТипКолонки = ТипЗнч(Данные);

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭтапыПроектаТЧТабличныеДанные.Номер
		|ИЗ
		|	Справочник.ЭтапыПроекта.ТЧТабличныеДанные КАК ЭтапыПроектаТЧТабличныеДанные
		|ГДЕ
		|	ЭтапыПроектаТЧТабличныеДанные.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ЭтапыПроектаТЧТабличныеДанные.Номер";

		Запрос.УстановитьПараметр("Ссылка", ЭтапПроекта);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			НоваяСтрока = Объект.ТчТабличныеДанные.Добавить();
			НоваяСтрока.ИмяКолонки = Данные;
			НоваяСтрока.Номер = ВыборкаДетальныеЗаписи.Номер;

		КонецЦикла;

	ИначеЕсли Действие = "КнопкаДобавитьСтроку" Тогда //Позже должны передавать номер строки после какой вставить 
															//Данные = НамерСтроки

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭтапыПроектаТЧТабличныеДанные.ИмяКолонки
		|ИЗ
		|	Справочник.ЭтапыПроекта.ТЧТабличныеДанные КАК ЭтапыПроектаТЧТабличныеДанные
		|ГДЕ
		|	ЭтапыПроектаТЧТабличныеДанные.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ЭтапыПроектаТЧТабличныеДанные.ИмяКолонки";

		Запрос.УстановитьПараметр("Ссылка", ЭтапПроекта);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ИначеЕсли Действие = "КнопкаДобавитьСтроку" Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	ЭтапыПроектаТЧТабличныеДанные.ИмяКолонки,
				|	МАКСИМУМ(ЭтапыПроектаТЧТабличныеДанные.Номер) КАК Номер
				|ИЗ
				|	Справочник.ЭтапыПроекта.ТЧТабличныеДанные КАК ЭтапыПроектаТЧТабличныеДанные
				|ГДЕ
				|	ЭтапыПроектаТЧТабличныеДанные.Ссылка = &Ссылка
				|СГРУППИРОВАТЬ ПО
				|	ЭтапыПроектаТЧТабличныеДанные.ИмяКолонки";
			
			Запрос.УстановитьПараметр("Ссылка", ЭтапПроекта);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				НоваяСтрока = Объект.ТчТабличныеДанные.Добавить();
				НоваяСтрока.ИмяКолонки = ВыборкаДетальныеЗаписи.ИмяКолонки;
				НоваяСтрока.Номер = ВыборкаДетальныеЗаписи.Номер + 1;
				//НоваяСтрока.Записать();

		КонецЦикла;
		
		//Данные - Строка с ИмяСтолбца	
	ИначеЕсли Действие = "КнопкаУдалитьСтолбец" Тогда

		СтрокаСтруктуры = Объект.ТчСтруктураКолонок.Найти(Данные, "ИмяКолонки");
		Объект.ТчСтруктураКолонок.Удалить(СтрокаСтруктуры);

		СтруктураДляПоиска = Новый Структура("ИмяКолонки", Данные);
		МассивНаУдаление = Объект.ТчТабличныеДанные.НайтиСтроки(СтруктураДляПоиска);

		Для Каждого Строка Из МассивНаУдаление Цикл

			Если Строка.ИмяКолонки = Данные Тогда

				Объект.ТчТабличныеДанные.Удалить(Строка);

			КонецЕсли;

		КонецЦикла;
		//Данные - намер Строка	
	ИначеЕсли Действие = "КнопкаУдалитьСтроку" Тогда

		Для Каждого Строка Из Объект.ТчТабличныеДанные Цикл

			Если Строка.Номер = Данные Тогда

				Объект.ТчТабличныеДанные.Удалить(Строка);

			КонецЕсли;

		КонецЦикла;

	ИначеЕсли Действие = "ИзменитьДанные" И Данные <> Неопределено Тогда

		Если ТипЗнч(Данные) = Тип("Строка") Тогда

			Объект.Текст = Данные;

		Иначе

			ТзКоманда = Новый ТаблицаЗначений;
			ТзКоманда.Колонки.Добавить("Ключ");
			ТзКоманда.Колонки.Добавить("Значение");

			Для Каждого Строка Из Данные Цикл
				НоваяСтрока = ТзКоманда.Добавить();
				НоваяСтрока.Ключ = Строка.Ключ;
				НоваяСтрока.Значение = Строка.Значение;
			КонецЦикла;

			Если ТзКоманда[0].Ключ = "ИзменитьСтроку" Тогда
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("ИмяКолонки", ТзКоманда[1].Значение);
				ПараметрыОтбора.Вставить("Номер", ТзКоманда[2].Значение);
				СтрокаТч = Объект.ТчТабличныеДанные.НайтиСтроки(ПараметрыОтбора);
				Если СтрокаТч.Количество() = 0 Тогда //Позже убрать
					СтрокаТч = Объект.ТчТабличныеДанные.Добавить();
					СтрокаТч.ИмяКолонки = ТзКоманда[1].Значение;
					СтрокаТч.Номер = ТзКоманда[2].Значение;
					СтрокаТч.ДанныеКолонки = ТзКоманда[0].Значение;
				Иначе
					СтрокаТч[0].ДанныеКолонки = ТзКоманда[0].Значение;
				КонецЕсли;
			ИначеЕсли ТзКоманда[0].Ключ = "ИзменитьКолонку" Тогда

				Для Каждого Строка Из Объект.ТчТабличныеДанные Цикл
					Если Строка.ИмяКолонки = ТзКоманда[1].Значение Тогда
						Строка.ИмяКолонки = ТзКоманда[0].Значение;
					КонецЕсли;
				КонецЦикла;

				СтрокаСтруктуры = Объект.ТчСтруктураКолонок.Найти(ТзКоманда[1].Значение);
				СтрокаСтруктуры.ИмяКолонки = ТзКоманда[0].Значение;

			КонецЕсли;

		КонецЕсли;

	ИначеЕсли Действие = "КнопкаОчиститьПоле" Тогда

		Объект.Текст = "";

	ИначеЕсли Действие = "КнопкаУдалитьЭлемент" Тогда

		Объект.УстановитьПометкуУдаления(Истина);

	Иначе

		ВыполненоУспешно = Ложь;

	КонецЕсли;
		
	ТзТабличныеДанные = Объект.ТчТабличныеДанные.Выгрузить();
	
	ПересчитатьНумерациюТаблицы(ТзТабличныеДанные);
	
	Объект.ТчТабличныеДанные.Загрузить(ТзТабличныеДанные);
	
	Объект.Записать();
	
	ВыполненоУспешно = Истина;
		
	//Исключение
		
		//ВыполненоУспешно = Ложь;
		
//	КонецПопытки;
		
	Возврат ВыполненоУспешно;
	
КонецФункции


Процедура ПересчитатьНумерациюТаблицы(ТчТабДанные) Экспорт
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТчТабДанные ИЗ &ТчТабДанные КАК ТчТабДанные";
	Запрос.УстановитьПараметр("ТчТабДанные", ТчТабДанные);
	Запрос.Выполнить();
	
//	Запрос = Новый Запрос();
//	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТчТабДанные.ИсходныйНомерСтроки КАК НомерСтроки,
		|	ТчТабДанные.ИмяКолонки КАК ИмяКолонки,
		|	ТчТабДанные.ДанныеКолонки КАК ДанныеКолонки,
		|	ТчТабДанные.Номер КАК Номер
		|ИЗ
		|	ТчТабДанные КАК ТчТабДанные
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	Номер УБЫВ
		|ИТОГИ
		|ПО
		|	ИмяКолонки";
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИмяКолонки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТчТабДанные.Очистить();
	
	Пока ВыборкаИмяКолонки.Следующий() Цикл
		
		Сч = 1;
	
		ВыборкаДетальныеЗаписи = ВыборкаИмяКолонки.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСтрока = ТчТабДанные.Добавить();
			НоваяСтрока.ИсходныйНомерСтроки = ВыборкаДетальныеЗаписи.НомерСтроки;
			НоваяСтрока.ИмяКолонки = ВыборкаДетальныеЗаписи.ИмяКолонки;
			НоваяСтрока.ДанныеКолонки = ВыборкаДетальныеЗаписи.Данныеколонки;
			НоваяСтрока.Номер = Сч;
			
			Сч = Сч + 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСВидео

Процедура РасшифроватьВидео(Объект)  

	
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("Родитель",Объект.Ссылка); 
	Запрос.УстановитьПараметр("ТипЭтапа",Перечисления.ТипЭтапа.РасшифровкаВидео);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапыПроекта.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
	               |ГДЕ
	               |	ЭтапыПроекта.Родитель = &Родитель
	               |	И ЭтапыПроекта.ТипЭтапа = &ТипЭтапа";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		РасшифровкаВидеоОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
	Иначе
		
		РасшифровкаВидеоОбъект = Справочники.ЭтапыПроекта.СоздатьЭлемент();
		РасшифровкаВидеоОбъект.Родитель = Объект.Ссылка; 
		РасшифровкаВидеоОбъект.Наименование = "РасшифровкаВидео";
		РасшифровкаВидеоОбъект.Файл = Объект.Файл;
		РасшифровкаВидеоОбъект.ТипЭтапа = Перечисления.ТипЭтапа.РасшифровкаВидео;
		
	КонецЕсли;
	
	РасшифровкаВидеоОбъект.Текст = РасшифроватьВидеоСервер.ПолучитьРасшифровкуВидео();
	РасшифровкаВидеоОбъект.Записать();   
	
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("Родитель",РасшифровкаВидеоОбъект.Ссылка); 
	Запрос.УстановитьПараметр("ТипЭтапа",Перечисления.ТипЭтапа.ОбработаннаяРасшифровка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапыПроекта.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
	               |ГДЕ
	               |	ЭтапыПроекта.Родитель = &Родитель
	               |	И ЭтапыПроекта.ТипЭтапа = &ТипЭтапа";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если не Выборка.Следующий() Тогда
		
		ОбработаннаяРасшифровкаОбъект = Справочники.ЭтапыПроекта.СоздатьЭлемент();
		ОбработаннаяРасшифровкаОбъект.Родитель = РасшифровкаВидеоОбъект.Ссылка;  
		ОбработаннаяРасшифровкаОбъект.Файл = Объект.Файл;   
		ОбработаннаяРасшифровкаОбъект.Наименование = "ОбработаннаяРасшифровка";
		ОбработаннаяРасшифровкаОбъект.ТипЭтапа = Перечисления.ТипЭтапа.ОбработаннаяРасшифровка;
		
		ОбработаннаяРасшифровкаОбъект.Записать();
			
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти 

#Область Печать

#КонецОбласти
	
#КонецЕсли

// BSLLS:NestedFunctionInParameters-on
// BSLLS:EmptyRegion-on
