#Область ОбщаяОбласть
//Возвращает ссылку на копию элемента справочника
//При этом копируются элементы подчиненных справочников
//АРГУМЕНТЫ:
//    Ссылка (СправочникСсылка) - Ссылка на копируемый элемент
//	  Наименование(Строка) - Наименование нового элемента справочника	
Функция КопироватьЭлементСправочника(Ссылка,Наименование) Экспорт
	
	ТзРодитель = Новый ТаблицаЗначений;
	ТзРодитель.Колонки.Добавить("Старый");
	ТзРодитель.Колонки.Добавить("Новый");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Этапы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Этапы КАК Этапы
		|ГДЕ
		|	Этапы.Ссылка В ИЕРАРХИИ(&Ссылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ТзРодитель.Добавить();
		Элемент = ВыборкаДетальныеЗаписи.Ссылка;
		СтрокаРодитель = ТзРодитель.Найти(Элемент.Родитель, "Старый"); 
		
		Если НЕ ВыборкаДетальныеЗаписи.Ссылка = Ссылка Тогда 
			
			НовыйЭлемент = Элемент.Скопировать();
			НовыйЭлемент.Родитель = СтрокаРодитель.Новый.Ссылка;
			НовыйЭлемент.Записать();
		Иначе 
			НовыйЭлемент = Элемент.Скопировать();
			НовыйЭлемент.Наименование = Наименование;
			НовыйЭлемент.Записать(); 
			
		КонецЕсли;
		
		НоваяСтрока.Старый = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.Новый = НовыйЭлемент;
		
	КонецЦикла;
	
	ЭлементНовыйКоренной = ТзРодитель[0].Новый;
	
	Возврат ЭлементНовыйКоренной;
	
КонецФункции

#КонецОбласти
