
&НаКлиенте
Процедура ОткрытьФормуКласса(Команда)  
	
	Если ЗначениеЗаполнено(Объект.Ссылка) и Модифицированность = ложь Тогда
	
		ПараметрыОткрытияФормы = Новый структура;
		ПараметрыОткрытияФормы.Вставить("Ключ", Объект.Ссылка);
		
		Оповещение = Новый ОписаниеОповещения("ОповещениеОЗакрытии", ЭтотОбъект); 
		
		ОткрытьФорму("Справочник.Классы.Форма.ФормаКласса", ПараметрыОткрытияФормы , ЭтаФорма, Истина , , ,Оповещение , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	Иначе
			
		Сообщить("Необходимо записать объект.");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОЗакрытии(Результат, ДополнительныеПараметры) Экспорт
	
	ОповещениеОЗакрытииСервер();	
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

Процедура ОповещениеОЗакрытииСервер()
	
	ЗначениеВРеквизитФормы(Объект.Ссылка.ПолучитьОбъект(),"Объект");
		
КонецПроцедуры