#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура УровеньМинус(Команда)
	Если СтрДлина(ПунктСписка) > 4 тогда 
		лМассивУровней=СтрРазделить(ПунктСписка,".");
		//лМассивУровней[лМассивУровней.Количество()-2]=Формат(Число(лМассивУровней[лМассивУровней.Количество()-1]+1),"ЧЦ=3; ЧДЦ=0; ЧВН=;");
		лМассивУровней.Удалить(лМассивУровней.Количество()-1);
		ПунктСписка=СтрСоединить(лМассивУровней,".");
		ОбновитьПунктСписка();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура УровеньПлюс(Команда)
	ПунктСписка=ПунктСписка+".001";	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодзадачу(Команда)
	ДобавитьОбластьТабДокНаСервере("Подзадача");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТаблицу(Команда)
	ДобавитьОбластьТабДокНаСервере("ЗаголовокТаблицы");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуТаблицы(Команда)
	ДобавитьОбластьТабДокНаСервере("СтрокаТаблицы");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТабличныйДокумент(Команда)
	ТабличныйДокументВывести();
КонецПроцедуры

#КонецОбласти
&НаКлиенте
Процедура ТабличныйДокПриИзмененииСодержимогоОбласти(Элемент, Область, ДополнительныеПараметры)
	Сообщить(Область.Имя+" содержит значение "+Область.значение);
КонецПроцедуры

&НаСервере
Процедура ДобавитьТаблицуНаСервере()
	
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лОбластьДанных=лМакет.ПолучитьОбласть("ЗаголовокТаблицы");
	
	ТабличныйДок.Вывести(лОбластьДанных);
КонецПроцедуры

&НАСервере
Процедура ОбработатьТ()
	Сообщить("!");
КонецПроцедуры





#Область ОбработкаТабличногоДокумента
&НаСервере
Процедура ТабличныйДокументВывести()
	ТабличныйДок.Очистить();
	ПунктСписка="001";
	Счетчик=0;
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лОбластьДанных=лМакет.ПолучитьОбласть("Заголовок");
	//лОбластьДанных
	ТабличныйДок.Вывести(лОбластьДанных);
КонецПроцедуры


&НаСервере
Процедура ДобавитьОбластьТабДокНаСервере(пИмяОбласти)
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лДобавкаУровня=ПолучитьУровеньЗадачи();
	лОбластьДанных=лМакет.ПолучитьОбласть(пИмяОбласти);
	для каждого лобласть из лОбластьДанных.Области цикл
		лОбласть.Имя=лОбласть.Имя+"_"+ПунктСписка;	
	КонецЦикла;
	лОбластьДанных.Область("R1C1").Текст=ПунктСписка;
	Если лДобавкаУровня тогда
		ТабличныйДок.Присоединить(лОбластьДанных);
	Иначе
		ТабличныйДок.Вывести(лОбластьДанных);
	КонецЕсли;
	
	 	
	
	ОбновитьПунктСписка();
	Счетчик=Счетчик+1;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПунктСписка()
	лНовыйУровень=Число(Прав(ПунктСписка,3));
	лНовыйУровень=Формат(лНовыйУровень+1,"ЧЦ=3; ЧДЦ=0; ЧВН=;");
	ПунктСписка=Лев(ПунктСписка,СтрДлина(ПунктСписка)-3)+лНовыйУровень;
КонецПроцедуры

&НаСервере
Функция ПолучитьУровеньЗадачи()
	лУровень=Цел(СтрДлина(ПунктСписка)/4);
	Если лУровень > 0 тогда
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	S=1;
	лРезультат=лМакет.ПолучитьОбласть("Ячейка");
	ТабличныйДок.Вывести(лРезультат);
	Пока S<лУровень цикл
		ТабличныйДок.Присоединить(лМакет.ПолучитьОбласть("Ячейка"));
		S=S+1;
	КонецЦикла;
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	
	КонецЕсли;

КонецФункции

&НаСервере
Процедура ВывестиПодзадачу(пИмяПодзадачи)
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лОбластьДанных=лМакет.ПолучитьОбласть("Подзадача");
	ТабличныйДок.Присоединить(лОбластьДанных);
	
	
КонецПроцедуры
#КонецОбласти
