#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	лЗапрос = новый Запрос;
	лЗапрос.текст="
	|Выбрать ссылка
	|из справочник.ЭтапыПроекта
	|Где Родитель.Наименование=""Шаблоны"" ";
	лВыборка=лЗапрос.Выполнить().Выбрать();
	
	Пока лВыборка.следующий() цикл
		Элементы.ШаблонПроекта.СписокВыбора.Добавить(лВыборка.ссылка);
	КонецЦикла;
		
		
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ШаблонПроектаПриИзменении(Элемент)
	ШаблонПроектаПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура УровеньМинус(Команда)
	УровеньИзменить("-");
КонецПроцедуры

&НаКлиенте
Процедура УровеньПлюс(Команда)
	УровеньИзменить("+");		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодзадачу(Команда)
	ДобавитьОбластьТабДокНаСервере("Подзадача");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТаблицу(Команда)
	ДобавитьОбластьТабДокНаСервере("ЗаголовокТаблицы");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуТаблицы(Команда)
	ДобавитьОбластьТабДокНаСервере("СтрокаТаблицы");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТабличныйДокумент(Команда)
	ТабличныйДокументВывести();
КонецПроцедуры


&НаКлиенте
Процедура РазвернутьСправочник(Команда)
	
	РазвернутьСправочникНаСервере();
	
	
КонецПроцедуры

&НаКлиенте// Описание
Процедура ТабличныйДокПриИзмененииСодержимогоОбласти(Элемент, Область, ДополнительныеПараметры)
	Сообщить(Область.Имя+" содержит значение "+Область.значение);
КонецПроцедуры

&НаСервере
Процедура ДобавитьТаблицуНаСервере()
	
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лОбластьДанных=лМакет.ПолучитьОбласть("ЗаголовокТаблицы");
	
	ТабличныйДок.Вывести(лОбластьДанных);
КонецПроцедуры

&НАСервере
Процедура ОбработатьТ()
	Сообщить("!");
КонецПроцедуры
#КонецОбласти




#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ШаблонПроектаПриИзмененииНаСервере()
	лОбъект=РеквизитФормыВЗначение("Объект");
	лДата=?(лОбъект.Дата=Дата(1,1,1),ТекущаяДата(),лОбъект.Дата);
	лГод=Формат(Год(лДата),"ЧГ=;");
	лНаименование=ПолучитьНаименованиеСледующий(ШаблонПроекта,лГод);
	лПроект=справочники.ЭтапыПроекта.КопироватьЭлементСправочника(ШаблонПроекта,лНаименование,лДата);
	Объект.Проект=лПроект.ссылка;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаименованиеСледующий(пСсылка, пГод)
	лГод=Справочники.ЭтапыПроекта.НайтиПоНаименованию(пГод,истина,,);
	лЗапрос = Новый Запрос;
	лЗапрос.текст="Выбрать первые 1
				   |наименование
				   |из справочник.ЭтапыПроекта
				   |где родитель в иерархии(&год)
				   |и родитель<>&год 
				   |и наименование подобно &Наименование
				   |Упорядочить по Наименование убыв
				   |";
	лЗапрос.Параметры.Вставить("год", лГод);
	лЗапрос.Параметры.Вставить("Наименование",""+пСсылка.наименование+"%");
	лВыборка=лЗапрос.Выполнить().Выбрать();
	Если лВыборка.Следующий() Тогда
		лНовыйНомер=пСсылка.Наименование + 
		Формат(Число(СтрЗаменить(лВыборка.Наименование, пСсылка.Наименование, ""))
			+ 1, "ЧЦ=3; ЧДЦ=0; ЧВН=;");
		Возврат лНовыйНомер;
	Иначе
		Возврат "" + пСсылка.Наименование + "001";
	КонецЕсли;
КонецФункции
#КонецОбласти




#Область ОбработкаТабличногоДокумента
&НаСервере
Процедура ТабличныйДокументВывести()
	ТабличныйДок.Очистить();
	ПунктСписка="001";
	Счетчик=0;
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лОбластьДанных=лМакет.ПолучитьОбласть("Заголовок");
	//лОбластьДанных
	ТабличныйДок.Вывести(лОбластьДанных);
КонецПроцедуры


&НаСервере
Процедура ДобавитьОбластьТабДокНаСервере(пИмяОбласти,пИмяСправочника="")
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лДобавкаУровня=ПолучитьУровеньЗадачи();
	лОбластьДанных=лМакет.ПолучитьОбласть(пИмяОбласти);
	для каждого лобласть из лОбластьДанных.Области цикл
		лОбласть.Имя=лОбласть.Имя+"_"+ПунктСписка+пИмяСправочника;	
	КонецЦикла;
	лОбластьДанных.Область("R1C1").Текст=ПунктСписка+пИмяСправочника;
	Если лДобавкаУровня тогда
		ТабличныйДок.Присоединить(лОбластьДанных);
	Иначе
		ТабличныйДок.Вывести(лОбластьДанных);
	КонецЕсли;
	
	 	
	
	ОбновитьПунктСписка();
	Счетчик=Счетчик+1;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПунктСписка()
	лНовыйУровень=Число(Прав(ПунктСписка,3));
	лНовыйУровень=Формат(лНовыйУровень+1,"ЧЦ=3; ЧДЦ=0; ЧВН=;");
	ПунктСписка=Лев(ПунктСписка,СтрДлина(ПунктСписка)-3)+лНовыйУровень;
КонецПроцедуры

&НаСервере
Функция ПолучитьУровеньЗадачи()
	лУровень=Цел(СтрДлина(ПунктСписка)/4);
	Если лУровень > 0 тогда
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	S=1;
	лРезультат=лМакет.ПолучитьОбласть("Ячейка");
	ТабличныйДок.Вывести(лРезультат);
	Пока S<лУровень цикл
		ТабличныйДок.Присоединить(лМакет.ПолучитьОбласть("Ячейка"));
		S=S+1;
	КонецЦикла;
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	
	КонецЕсли;

КонецФункции

&НаСервере
Процедура ВывестиПодзадачу(пИмяПодзадачи)
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лОбластьДанных=лМакет.ПолучитьОбласть("Подзадача");
	ТабличныйДок.Присоединить(лОбластьДанных);
	
	
КонецПроцедуры


&НаСервере
Процедура РазвернутьСправочникНаСервере()
лЗапрос = Новый Запрос;
лЗапрос.Текст = 
"ВЫБРАТЬ
|	ЭтапыПроекта.Ссылка КАК Ссылка,
|	ЭтапыПроекта.ВерсияДанных КАК ВерсияДанных,
|	ЭтапыПроекта.ПометкаУдаления КАК ПометкаУдаления,
|	ЭтапыПроекта.Родитель КАК Родитель,
|	ЭтапыПроекта.Код КАК Код,
|	ЭтапыПроекта.Наименование КАК Наименование
|ИЗ
|	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
|	Где ссылка=(&Родитель)
|	
|Объединить все	
|
|ВЫБРАТЬ
|	ЭтапыПроекта.Ссылка КАК Ссылка,
|	ЭтапыПроекта.ВерсияДанных КАК ВерсияДанных,
|	ЭтапыПроекта.ПометкаУдаления КАК ПометкаУдаления,
|	ЭтапыПроекта.Родитель КАК Родитель,
|	ЭтапыПроекта.Код КАК Код,
|	ЭтапыПроекта.Наименование КАК Наименование
|ИЗ
|	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
|	Где Родитель В Иерархии(&Родитель)
|	
|
|	Упорядочить по код иерархия";

лЗапрос.УстановитьПараметр("Родитель",Объект.Проект);
лРезультат = лЗапрос.Выполнить().Выгрузить();

//лПредыдущий="";	
лУровеньИерархии=Новый соответствие;
//лУровеньИерархии=Новый массив();
Для каждого лСтрока из лРезультат цикл
		Если лСтрока.Ссылка=Объект.Проект тогда
			ТабличныйДокументВывести();
			лУровеньИерархии.Вставить(лСтрока.Ссылка,0);
			лДобавочноеЧислоУровня=0;
			лПредыдущий=лСтрока;
		КонецЕсли;
		
		Если лСтрока.Родитель=лПредыдущий.Ссылка И лУровеньИерархии.Получить(лСтрока.Родитель)=0 тогда
			ДобавитьОбластьТабДокНаСервере("Подзадача",лСтрока.Наименование);
			лУровеньИерархии.Вставить(лСтрока.Ссылка,1);
			лПредыдущий=лСтрока;
		ИначеЕсли лСтрока.Родитель=лПредыдущий.Родитель	тогда	
			ДобавитьОбластьТабДокНаСервере("Подзадача",лСтрока.Наименование);
			лПредыдущий=лСтрока;	
		ИначеЕсли лСтрока.Родитель=лПредыдущий.Ссылка	тогда		
				лДобавочноеЧислоУровня=лДобавочноеЧислоУровня+1;
				УровеньИзменить("+");
				лУровеньИерархии.Вставить(лСтрока.Ссылка,1+лДобавочноеЧислоУровня);
				ДобавитьОбластьТабДокНаСервере("Подзадача",лСтрока.Наименование);
				лПредыдущий=лСтрока;
		Иначе лСмещениеВлево=лДобавочноеЧислоУровня-лУровеньИерархии.Получить(лСтрока.Родитель);
			ж=0;
			Пока ж<лСмещениеВлево цикл
				УровеньИзменить("-");
				ж=ж+1;
			КОнецЦикла;	
			ДобавитьОбластьТабДокНаСервере("Подзадача",лСтрока.Наименование);
			лПредыдущий=лСтрока;
		КонецЕсли; 

КонецЦикла;		
	
	
КонецПроцедуры

&НаСервере
Процедура УровеньИзменить(пНаправление)
	Если пНаправление="-" тогда
	
	Если СтрДлина(ПунктСписка) > 4 тогда 
		лМассивУровней=СтрРазделить(ПунктСписка,".");
		лМассивУровней.Удалить(лМассивУровней.Количество()-1);
		ПунктСписка=СтрСоединить(лМассивУровней,".");
		ОбновитьПунктСписка();
	КонецЕсли;
	ИначеЕсли пНаправление="+" тогда ПунктСписка=ПунктСписка+".001"; 
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
