
&НаКлиенте
Процедура ТабличныйДокПриИзменении(Элемент)
	Сообщить(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТабличныйДокумент(Команда)
	ТабличныйДокументВывести();
КонецПроцедуры

&НаСервере
Процедура ТабличныйДокументВывести()
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лОбластьДанных=лМакет.ПолучитьОбласть("Заголовок");
	//лОбластьДанных
	ТабличныйДок.Вывести(лОбластьДанных);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодзадачу(Команда)
	ВывестиПодзадачу("ИмяПодзадачи");
КонецПроцедуры

&НаСервере
Процедура ВывестиПодзадачу(пИмяПодзадачи)
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лОбластьДанных=лМакет.ПолучитьОбласть("Подзадача");
	ТабличныйДок.Присоединить(лОбластьДанных);
	
	
КонецПроцедуры
