#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	лЗапрос = новый Запрос;
	лЗапрос.текст="
	|Выбрать ссылка
	|из справочник.ЭтапыПроекта
	|Где Родитель.Наименование=""Шаблоны"" ";
	лВыборка=лЗапрос.Выполнить().Выбрать();
	
	Пока лВыборка.следующий() цикл
		Элементы.ШаблонПроекта.СписокВыбора.Добавить(лВыборка.ссылка);
	КонецЦикла;
		
		
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ШаблонПроектаПриИзменении(Элемент)
	ШаблонПроектаПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура УровеньМинус(Команда)
	УровеньИзменить("-");
КонецПроцедуры

&НаКлиенте
Процедура УровеньПлюс(Команда)
	УровеньИзменить("+");		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодзадачу(Команда)
	ДобавитьОбластьТабДокНаСервере("Подзадача");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТаблицу(Команда)
	ДобавитьОбластьТабДокНаСервере("ЗаголовокТаблицы");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуТаблицы(Команда)
	ДобавитьОбластьТабДокНаСервере("СтрокаТаблицы");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТабличныйДокумент(Команда)
	ТабличныйДокументВывести();
КонецПроцедуры


&НаКлиенте
Процедура РазвернутьСправочник(Команда)
	
	РазвернутьСправочникНаСервере();
	
	
КонецПроцедуры

#КонецОбласти
&НаКлиенте// Описание
Процедура ТабличныйДокПриИзмененииСодержимогоОбласти(Элемент, Область, ДополнительныеПараметры)
	Сообщить(Область.Имя+" содержит значение "+Область.значение);
КонецПроцедуры

&НаСервере
Процедура ДобавитьТаблицуНаСервере()
	
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лОбластьДанных=лМакет.ПолучитьОбласть("ЗаголовокТаблицы");
	
	ТабличныйДок.Вывести(лОбластьДанных);
КонецПроцедуры

&НАСервере
Процедура ОбработатьТ()
	Сообщить("!");
КонецПроцедуры

&НаКлиенте
Процедура ВставитьПодзадачу(Команда)
	//ВставитьОбластьТабДокНаСервере("Подзадача",,ТабличныйДок.текущаяОбласть.Верх);
	пСмещение=ТабличныйДок.текущаяОбласть.Верх;
	лМассивКоординат=новый массив;
	лМассивКоординат.Добавить("R"+(пСмещение+1));
	лМассивКоординат.Добавить("C"+(1+ТекущийУровень()));
	лМассивКоординат.Добавить(":");
	лМассивКоординат.Добавить("R"+(пСмещение+4));
	лМассивКоординат.Добавить("C"+(3+ТекущийУровень()));
	R1=((пСмещение+1));
	C1=((1+ТекущийУровень()));
	
	R2=((пСмещение+4));
	C2=((3+ТекущийУровень()));
	мм=Новый массив;
	//мм.Добавить(ТабличныйДок.Область(СтрСоединить(лМассивКоординат)));
	мм.Добавить(ТабличныйДок.Область(R1,C1,R2,C2));
	лОБластьВставки=мм;
	Элементы.ТабличныйДок.УстановитьВыделенныеОбласти(лОБластьВставки);
	ВставитьОбластьТабДокНаСервере("Подзадача",,ТабличныйДок.текущаяОбласть.Верх)
КонецПроцедуры


&НаКлиенте
Процедура тест(Команда)
	ТестНаСервере(ТабличныйДок.текущаяОбласть.Верх);
КонецПроцедуры







#Область ОбработкаТабличногоДокумента
&НаСервере
Процедура ТабличныйДокументВывести()
	ТабличныйДок.Очистить();
	ПунктСписка="001";
	Счетчик=0;
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лОбластьДанных=лМакет.ПолучитьОбласть("Заголовок");
	//лОбластьДанных
	ТабличныйДок.Вывести(лОбластьДанных);
КонецПроцедуры


&НаСервере
Процедура ДобавитьОбластьТабДокНаСервере(пИмяОбласти,пИмяСправочника="")
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лДобавкаУровня=ПолучитьУровеньЗадачи();
	лОбластьДанных=лМакет.ПолучитьОбласть(пИмяОбласти);
	для каждого лобласть из лОбластьДанных.Области цикл
		лОбласть.Имя=лОбласть.Имя+"_"+ПунктСписка+пИмяСправочника;	
	КонецЦикла;
	лОбластьДанных.Область("R1C1").Текст=ПунктСписка+пИмяСправочника;
	Если лДобавкаУровня тогда
		ТабличныйДок.Присоединить(лОбластьДанных);
	Иначе
		ТабличныйДок.Вывести(лОбластьДанных);
	КонецЕсли;
	
	 	
	
	ОбновитьПунктСписка();
	Счетчик=Счетчик+1;
	
КонецПроцедуры


&НаСервере
Процедура ВставитьОбластьТабДокНаСервере(пИмяОбласти,пИмяСПР="",пСмещение=0)
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	//лДобавкаУровня=ПолучитьУровеньЗадачи();
	лОбластьДанных_=лМакет.ПолучитьОбласть(пИмяОбласти);
	для каждого лобласть из лОбластьДанных_.Области цикл
		лОбласть.Имя=лОбласть.Имя+"_"+ПунктСписка+пИмяСПР;	
	КонецЦикла;
	лОбластьДанных_.Область("R1C1").Текст=ПунктСписка+пИмяСПР;
//	Если лДобавкаУровня тогда
//		ТабличныйДок.Присоединить(лОбластьДанных);
//	Иначе
//		ТабличныйДок.Вывести(лОбластьДанных);
//	КонецЕсли;
//	
	лВысота=лОбластьДанных_.высотаТаблицы;
	лШирина=лОбластьДанных_.ШиринаТаблицы;
	R1=((пСмещение+1));
	C1=((1+ТекущийУровень()));
	
	R2=((пСмещение+лВысота));
	C2=((лШирина+ТекущийУровень()));
	мм=Новый массив;
	//мм.Добавить(ТабличныйДок.Область(СтрСоединить(лМассивКоординат)));
	лОбластьВставки=ТабличныйДок.Область(R1,C1,R2,C2);
	лОбластьДанных=лОбластьДанных_.Область(1,1,лВысота,лШирина);
	ТабличныйДок.ВставитьОбласть(лОбластьДанных,лОбластьВставки, ТипСмещенияТабличногоДокумента.ПоВертикали); 
	//ТабличныйДок.ВставитьОбласть(лОбластьДанных, ТабличныйДок.Область("C"+ТабличныйДок.текущаяОбласть.Верх+1));
	 	
	
	//ОбновитьПунктСписка();
КонецПроцедуры
&НаСервере
Процедура ОбновитьПунктСписка()
	лНовыйУровень=Число(Прав(ПунктСписка,3));
	лНовыйУровень=Формат(лНовыйУровень+1,"ЧЦ=3; ЧДЦ=0; ЧВН=;");
	ПунктСписка=Лев(ПунктСписка,СтрДлина(ПунктСписка)-3)+лНовыйУровень;
КонецПроцедуры

&НаСервере
Функция ПолучитьУровеньЗадачи()
	лУровень=Цел(СтрДлина(ПунктСписка)/4);
	Если лУровень > 0 тогда
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	S=1;
	лРезультат=лМакет.ПолучитьОбласть("Ячейка");
	ТабличныйДок.Вывести(лРезультат);
	Пока S<лУровень цикл
		ТабличныйДок.Присоединить(лМакет.ПолучитьОбласть("Ячейка"));
		S=S+1;
	КонецЦикла;
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	
	КонецЕсли;

КонецФункции

&НаСервере
Функция ТекущийУровень()
	Возврат Цел(СтрДлина(ПунктСписка)/4);
КонецФункции
&НаСервере
Процедура ВывестиПодзадачу(пИмяПодзадачи)
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лОбластьДанных=лМакет.ПолучитьОбласть("Подзадача");
	ТабличныйДок.Присоединить(лОбластьДанных);
	
	
КонецПроцедуры


&НаСервере
Процедура РазвернутьСправочникНаСервере()
лЗапрос = Новый Запрос;
лЗапрос.Текст = 
"ВЫБРАТЬ
|	ЭтапыПроекта.Ссылка КАК Ссылка,
|	ЭтапыПроекта.ВерсияДанных КАК ВерсияДанных,
|	ЭтапыПроекта.ПометкаУдаления КАК ПометкаУдаления,
|	ЭтапыПроекта.Родитель КАК Родитель,
|	ЭтапыПроекта.Код КАК Код,
|	ЭтапыПроекта.Наименование КАК Наименование
|ИЗ
|	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
|	Где ссылка=(&Родитель)
|	
|Объединить все	
|
|ВЫБРАТЬ
|	ЭтапыПроекта.Ссылка КАК Ссылка,
|	ЭтапыПроекта.ВерсияДанных КАК ВерсияДанных,
|	ЭтапыПроекта.ПометкаУдаления КАК ПометкаУдаления,
|	ЭтапыПроекта.Родитель КАК Родитель,
|	ЭтапыПроекта.Код КАК Код,
|	ЭтапыПроекта.Наименование КАК Наименование
|ИЗ
|	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
|	Где Родитель В Иерархии(&Родитель)
|	
|
|	Упорядочить по код иерархия";

лЗапрос.УстановитьПараметр("Родитель",Объект.Проект);
лРезультат = лЗапрос.Выполнить().Выгрузить();

//лПредыдущий="";	
лУровеньИерархии=Новый соответствие;
//лУровеньИерархии=Новый массив();
Для каждого лСтрока из лРезультат цикл
		Если лСтрока.Ссылка=Объект.Проект тогда
			ТабличныйДокументВывести();
			лУровеньИерархии.Вставить(лСтрока.Ссылка,0);
			лДобавочноеЧислоУровня=0;
			лПредыдущий=лСтрока;
		КонецЕсли;
		
		Если лСтрока.Родитель=лПредыдущий.Ссылка И лУровеньИерархии.Получить(лСтрока.Родитель)=0 тогда
			ДобавитьОбластьТабДокНаСервере("Подзадача",лСтрока.Наименование);
			лУровеньИерархии.Вставить(лСтрока.Ссылка,1);
			лПредыдущий=лСтрока;
		ИначеЕсли лСтрока.Родитель=лПредыдущий.Родитель	тогда	
			ДобавитьОбластьТабДокНаСервере("Подзадача",лСтрока.Наименование);
			лПредыдущий=лСтрока;	
		ИначеЕсли лСтрока.Родитель=лПредыдущий.Ссылка	тогда		
				лДобавочноеЧислоУровня=лДобавочноеЧислоУровня+1;
				УровеньИзменить("+");
				лУровеньИерархии.Вставить(лСтрока.Ссылка,1+лДобавочноеЧислоУровня);
				ДобавитьОбластьТабДокНаСервере("Подзадача",лСтрока.Наименование);
				лПредыдущий=лСтрока;
		Иначе лСмещениеВлево=лДобавочноеЧислоУровня-лУровеньИерархии.Получить(лСтрока.Родитель);
			ж=0;
			Пока ж<лСмещениеВлево цикл
				УровеньИзменить("-");
				ж=ж+1;
			КОнецЦикла;	
			ДобавитьОбластьТабДокНаСервере("Подзадача",лСтрока.Наименование);
			лПредыдущий=лСтрока;
		КонецЕсли; 

КонецЦикла;		
	
	
КонецПроцедуры

&НаСервере
Процедура УровеньИзменить(пНаправление)
	Если пНаправление="-" тогда
	
	Если СтрДлина(ПунктСписка) > 4 тогда 
		лМассивУровней=СтрРазделить(ПунктСписка,".");
		лМассивУровней.Удалить(лМассивУровней.Количество()-1);
		ПунктСписка=СтрСоединить(лМассивУровней,".");
		ОбновитьПунктСписка();
	КонецЕсли;
	ИначеЕсли пНаправление="+" тогда ПунктСписка=ПунктСписка+".001"; 
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ТестНаСервере(пСмещение)
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	//лДобавкаУровня=ПолучитьУровеньЗадачи();
	лОбластьДанных=лМакет.Область("Подзадача");
	х=0;
	Пока х<9 цикл
		ТабличныйДок.ВставитьОбласть( ТабличныйДок.Область("R1000"), ТабличныйДок.Область("R"+пСмещение),ТипСмещенияТабличногоДокумента.ПоВертикали);
		х=х+1;
	КонецЦикла;
	ТабличныйДок.ВставитьОбласть( лОбластьДанных, ,ТипСмещенияТабличногоДокумента.ПоВертикали);
КонецПроцедуры
#КонецОбласти
