
&НаКлиенте
Процедура ТабличныйДокПриИзмененииСодержимогоОбласти(Элемент, Область, ДополнительныеПараметры)
	Сообщить(Область.Имя+" содержит значение "+Область.значение);
КонецПроцедуры

&НаСервере
Процедура ДобавитьТаблицуНаСервере()
	
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лОбластьДанных=лМакет.ПолучитьОбласть("ЗаголовокТаблицы");
	
	ТабличныйДок.Вывести(лОбластьДанных);
КонецПроцедуры

&НАСервере
Процедура ОбработатьТ()
	Сообщить("!");
КонецПроцедуры



&НаКлиенте
Процедура ОбновитьТабличныйДокумент(Команда)
	ТабличныйДокументВывести();
КонецПроцедуры

&НаСервере
Процедура ТабличныйДокументВывести()
	ТабличныйДок.Очистить();
	Счетчик=0;
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лОбластьДанных=лМакет.ПолучитьОбласть("Заголовок");
	//лОбластьДанных
	ТабличныйДок.Вывести(лОбластьДанных);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодзадачу(Команда)
	ДобавитьОбластьТабДокНаСервере("Подзадача");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТаблицу(Команда)
	ДобавитьОбластьТабДокНаСервере("ЗаголовокТаблицы");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуТаблицы(Команда)
	ДобавитьОбластьТабДокНаСервере("СтрокаТаблицы");
КонецПроцедуры

&НаСервере
Процедура ДобавитьОбластьТабДокНаСервере(ИмяОбласти)
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лОбластьДанных=лМакет.ПолучитьОбласть(ИмяОбласти);
	для каждого лобласть из лОбластьДанных.Области цикл
		лОбласть.Имя=лОбласть.Имя+"_"+Счетчик;	
	КонецЦикла;	
	ТабличныйДок.Вывести(лОбластьДанных);
	Счетчик=Счетчик+1;
КонецПроцедуры

&НаСервере
Процедура ВывестиПодзадачу(пИмяПодзадачи)
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лОбластьДанных=лМакет.ПолучитьОбласть("Подзадача");
	ТабличныйДок.Присоединить(лОбластьДанных);
	
	
КонецПроцедуры
