  // Работа с формами (клиент).
//
// BSLLS:NestedFunctionInParameters-off - без лишних переменных выполнение быстрее
// BSLLS:EmptyRegion-off - пустые области разрешены

#Область ПрограммныйИнтерфейс

// Обработчик события ПриИзменении поля формы
//
// Параметры:
//  Элемент	 - ПолеФормы - поле формы в котором изменили значение
//  Форма	 - ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//
Процедура ПриИзмененииЭлемента(Элемент, Форма) Экспорт

	
КонецПроцедуры

// Вызывается в формах при выборе команды, которая добавлена программно
//
// Параметры:
//  Форма					 - ФормаКлиентскогоПриложения - форма в которой расположена команда
//  Команда					 - КомандаФормы - выбранная команда
//  ДополнительныеПараметры	 - Структура - дополнительные параметры.
//
Процедура ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#Область СправочникКонтрагенты
#КонецОбласти

#Область СправочникСклады
#КонецОбласти

#Область ПереопределяемыеКоманды

#КонецОбласти

#КонецОбласти

// BSLLS:NestedFunctionInParameters-on
// BSLLS:EmptyRegion-on

