
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.ПриСозданииНаСервере(ЭтаФорма); 

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеПриИзмененииДанныхСписокВыбораЭлемент(Элемент)  

	Если Лев(Элемент.ВыделенныйТекст, 6) = "Группа" тогда
		
		Если Элемент.Родитель.Вид = ВидГруппыФормы.Страница тогда  
		
			ВыполнитьДействиеПриИзмененииДанныхСписокВыбораЭлементСервер(Элемент.Имя, Элемент.ВыделенныйТекст + Элемент.Родитель.Имя);
			
		ИначеЕсли Элемент.Родитель.Родитель.Вид = ВидГруппыФормы.Страница Тогда
			
			ВыполнитьДействиеПриИзмененииДанныхСписокВыбораЭлементСервер(Элемент.Имя, Элемент.ВыделенныйТекст + Элемент.Родитель.Родитель.Имя);
			
		ИначеЕсли Элемент.Родитель.Родитель.Родитель.Вид = ВидГруппыФормы.Страница Тогда
			
			ВыполнитьДействиеПриИзмененииДанныхСписокВыбораЭлементСервер(Элемент.Имя, Элемент.ВыделенныйТекст + Элемент.Родитель.Родитель.Родитель.Имя);
			
		КонецЕсли; 
		
	Иначе
		
		ВыполнитьДействиеПриИзмененииДанныхСписокВыбораЭлементСервер(Элемент.Имя, Элемент.ВыделенныйТекст);
		
	КонецЕсли;
	
	Этаформа.ВладелецФормы.Модифицированность = Истина;
	
КонецПроцедуры  

Процедура ВыполнитьДействиеПриИзмененииДанныхСписокВыбораЭлементСервер(ЭлементИмя, ЭлементВыделенныйТекст)  
	
	Элементы.Переместить(Элементы[ЭлементИмя], Элементы[ЭлементВыделенныйТекст]);
	
КонецПроцедуры  

&НаКлиенте
Процедура ВыполнитьДействиеПриИзмененииДанныхСписокВыбораТаблицаЭлемент(Элемент)  
	
	Если Лев(Элемент.ВыделенныйТекст, 6) = "Группа" тогда
		
		Если Элемент.Родитель.Родитель.Вид = ВидГруппыФормы.Страница тогда  
		
			ВыполнитьДействиеПриИзмененииДанныхСписокВыбораЭлементСервер(Элемент.Родитель.Имя, Элемент.ВыделенныйТекст + Элемент.Родитель.Родитель.Имя);
			
		ИначеЕсли Элемент.Родитель.Родитель.Родитель.Вид = ВидГруппыФормы.Страница Тогда
			
			ВыполнитьДействиеПриИзмененииДанныхСписокВыбораЭлементСервер(Элемент.Родитель.Имя, Элемент.ВыделенныйТекст + Элемент.Родитель.Родитель.Родитель.Имя);
			
		ИначеЕсли Элемент.Родитель.Родитель.Родитель.Родитель.Вид = ВидГруппыФормы.Страница Тогда
			
			ВыполнитьДействиеПриИзмененииДанныхСписокВыбораЭлементСервер(Элемент.Родитель.Имя, Элемент.ВыделенныйТекст + Элемент.Родитель.Родитель.Родитель.Родитель.Имя);
			
		КонецЕсли; 
		
	Иначе
		
		ВыполнитьДействиеПриИзмененииДанныхСписокВыбораЭлементСервер(Элемент.Родитель.Имя, Элемент.ВыделенныйТекст);
		
	КонецЕсли; 
	
	Этаформа.ВладелецФормы.Модифицированность = Истина;
	
КонецПроцедуры  

Процедура ВыполнитьДействиеПриИзмененииДанныхСписокВыбораТаблицаЭлементСервер(ЭлементИмя, ЭлементВыделенныйТекст)  
	
	Элементы.Переместить(Элементы[ЭлементИмя], Элементы[ЭлементВыделенныйТекст]); 
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	Класс = РеквизитФормыВЗначение("Объект");
			
	Итератор = 0;

	Для каждого стр из Класс.ТЧРеквизиты Цикл
		
		Если Элементы["ЭлементТЧРеквизитыСтраницаРеквизитыКлассаСписокВыбора" + Строка(Итератор)].Родитель.Вид =  ВидГруппыФормы.Страница Тогда
			
			стр.СтраницаНаФорме = Элементы["ЭлементТЧРеквизитыСтраницаРеквизитыКлассаСписокВыбора" + Строка(Итератор)].Родитель.Имя; 
			стр.ГруппаНаСтранице = "";
			
		Иначе
			
			стр.ГруппаНаСтранице = ЭтаФорма["ТЧРеквизитыСтраницаРеквизитыКласса" + Итератор];
			
			Если Элементы["ЭлементТЧРеквизитыСтраницаРеквизитыКлассаСписокВыбора" + Строка(Итератор)].Родитель.Родитель.Родитель.Вид =  ВидГруппыФормы.Страница Тогда
				
				стр.СтраницаНаФорме = Элементы["ЭлементТЧРеквизитыСтраницаРеквизитыКлассаСписокВыбора" + Строка(Итератор)].Родитель.Родитель.Родитель.Имя; 
				
			КонецЕсли;
				
		КонецЕсли;  
		 
		Итератор = Итератор + 1;
		
	КонецЦикла;
	
	
	Итератор = 0;
		
	Для каждого стр из Класс.ТЧСтруктураТаблиц Цикл

		Если Элементы["ЭлементГруппаТЧСтруктураТаблиц" + стр.ИмяТаблицы  + Строка(Итератор)].Родитель.Вид =  ВидГруппыФормы.Страница Тогда
			
			стр.СтраницаНаФорме = Элементы["ЭлементГруппаТЧСтруктураТаблиц" + стр.ИмяТаблицы + Строка(Итератор)].Родитель.Имя; 
			стр.ГруппаНаСтранице = "";
			
		Иначе
			
			стр.ГруппаНаСтранице = ЭтаФорма["ТЧСтруктураТаблицСтраницаФормаКласса" + Итератор];
			
			Если Элементы["ЭлементТЧРеквизитыТаблицФормаКлассаСписокВыбора" + Строка(Итератор)].Родитель.Родитель.Родитель.Родитель.Вид =  ВидГруппыФормы.Страница Тогда
				
				стр.СтраницаНаФорме = Элементы["ЭлементТЧРеквизитыТаблицФормаКлассаСписокВыбора" + Строка(Итератор)].Родитель.Родитель.Родитель.Родитель.Имя; 
				
			КонецЕсли;
				
		КонецЕсли;  
		 
		Итератор = Итератор + 1;

	КонецЦикла;  
	
	Класс.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы) 
	
	ПриЗакрытииНаСервере(); 
	
КонецПроцедуры




#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
