#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТипЭтапаПриИзменении(Элемент)
	
	ВидимостьГруппаВидео(Объект.Родитель, Объект.ТипЭтапа);

КонецПроцедуры
#КонецОбласти






&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ГиперссылкаФайлов = РаботаСФайлами.ГиперссылкаФайлов();
	ГиперссылкаФайлов.Размещение = "Файлы";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ГиперссылкаФайлов);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	ВидимостьГруппаВидео(Объект.Родитель,Объект.ТипЭтапа);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	ВидимостьГруппаВидео(Объект.Родитель,Объект.ТипЭтапа);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры


// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)

	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);

КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

//ВидимостьПолей
&НаСервере
Процедура ВидимостьГруппаВидео(Родитель, Признак)
	
	Элементы.Видео.Видимость = Ложь;
	Элементы.РасшифровкаВидео.Видимость = Ложь;
	Элементы.ДетализацияРасшифровки.Видимость = Ложь;
	
	Если Признак = Перечисления.ТипЭтапа.Видео Тогда
		Элементы.Видео.Видимость = Истина;
	ИначеЕсли Признак = Перечисления.ТипЭтапа.РасшифровкаВидео Тогда
		Элементы.РасшифровкаВидео.Видимость = Истина;
	ИначеЕсли Признак = Перечисления.ТипЭтапа.ОбработаннаяРасшифровка Тогда
		Элементы.ДетализацияРасшифровки.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры
//Конец ВидимостьПолей