#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТипЭтапаПриИзменении(Элемент)
	
	Объект.ТЧДействия.Очистить();
	
	ТипЭтапаПриИзмененииНаСервере();
	
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыТЧТабличныеДанные
&НаКлиенте
Процедура ТЧТабличныеДанныеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТЧТабличныеДанныеПриОкончанииРедактированияНаСервере();
	
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыТчДанныеСписка
&НаКлиенте
Процедура ТчДанныеСпискаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТчДанныеСпискаПередОкончаниемРедактированияНаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ТипЭтапаПриИзмененииНаСервере()
	
	ТаблицаДействий = Справочники.ЭтапыПроекта.ПолучитьДействия(Объект.ТипЭтапа);
	
	Объект.ТЧДействия.Загрузить(ТаблицаДействий);
	
КонецПроцедуры

&НаСервере
Процедура ТЧТабличныеДанныеПриОкончанииРедактированияНаСервере()
	
ТзТабличныеДанные = Объект.ТчТабличныеДанные.Выгрузить();
	
Справочники.ЭтапыПроекта.ПересчитатьНумерациюТаблицы(ТзТабличныеДанные, Объект.ТипЭтапа);
	
Объект.ТЧТабличныеДанные.Загрузить(ТзТабличныеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ТчДанныеСпискаПередОкончаниемРедактированияНаСервере()
	
	ТзТабличныеДанные = Объект.ТчДанныеСписка.Выгрузить();
	
	Справочники.ЭтапыПроекта.ПересчитатьНумерациюТаблицы(ТзТабличныеДанные, Объект.ТипЭтапа);
		
	Объект.ТчДанныеСписка.Загрузить(ТзТабличныеДанные);
КонецПроцедуры
#КонецОбласти



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ГиперссылкаФайлов = РаботаСФайлами.ГиперссылкаФайлов();
	ГиперссылкаФайлов.Размещение = "Файлы";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ГиперссылкаФайлов);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	Значение = ОтборФайл(Объект.Ссылка);
	
	Элементы.Файл.СписокВыбора.ЗагрузитьЗначения(Значение);
	
	
	//ВидимостьГруппаВидео(Объект.Родитель,Объект.ТипЭтапа);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

	//ОтборФайл(Объект.Ссылка);
	
КонецПроцедуры


// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)

	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
	
	
	Значение = ОтборФайл(Объект.Ссылка);
	
	Элементы.Файл.СписокВыбора.ЗагрузитьЗначения(Значение);
	
	Если Значение.Количество() = 1 Тогда 
		
		Объект.Файл = Элементы.Файл.СписокВыбора[0].Значение;
		
	КонецЕсли;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

//ВидимостьПолей
//&НаСервере
//Процедура ВидимостьГруппаВидео(Родитель, Признак)
	
	//Элементы.Файл.Видимость = Ложь;
	//Элементы.ФормаРасшифроватьВидео.Видимость = Ложь;
	
	//Если Признак = Перечисления.ТипЭтапа.Видео Тогда
		//Элементы.Файл.Видимость = Истина;
	//КонецЕсли;
	
	//Если Признак = Перечисления.ТипЭтапа.Видео ИЛИ 
		 //Признак = Перечисления.ТипЭтапа.РасшифровкаВидео ИЛИ
		 //Признак = Перечисления.ТипЭтапа.ОбработаннаяРасшифровка	Тогда
		
		//Элементы.ФормаРасшифроватьВидео.Видимость = Истина;
		
	//КонецЕсли;
	
//КонецПроцедуры
//Конец ВидимостьПолей

&НаКлиенте
Процедура РасшифроватьВидео(Команда)
	
	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Элемент должен быть записан.");
		возврат;
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(Объект.Файл) тогда
		РасшифроватьВидеоНаСервере();
	Иначе
		Сообщить("Заполните Файл.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтборФайл(СсылкаНаОбъект)
	
	Значение = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭтапыПроектаПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла,
		|	ЭтапыПроектаПрисоединенныеФайлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭтапыПроектаПрисоединенныеФайлы КАК ЭтапыПроектаПрисоединенныеФайлы
		|ГДЕ
		|	ЭтапыПроектаПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
		|	И НЕ ЭтапыПроектаПрисоединенныеФайлы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВладелецФайла", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Значение.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		
	КонецЦикла;
	
	Возврат Значение;
	
КонецФункции


&НаСервере
Процедура РасшифроватьВидеоНаСервере()
	
	Справочники.ЭтапыПроекта.ВыполнитьДействие(Объект.ТипЭтапа, "КнопкаДействияРасшифровкаВидео", Объект);
	
КонецПроцедуры  


















