#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти






&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ГиперссылкаФайлов = РаботаСФайлами.ГиперссылкаФайлов();
	ГиперссылкаФайлов.Размещение = "Файлы";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ГиперссылкаФайлов);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	ВидимостьГруппаВидео(Объект.Родитель,Объект.ТипЭтапа);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	ВидимостьГруппаВидео(Объект.Родитель,Объект.ТипЭтапа);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры


// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)

	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);

КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

//ВидимостьПолей
&НаСервере
Процедура ВидимостьГруппаВидео(Родитель, Признак)
	
	Элементы.Видео.Видимость = Ложь;
	Элементы.РасшифровкаВидео.Видимость = Ложь;
	Элементы.ДетализацияРасшифровки.Видимость = Ложь;
	Элементы.ФормаРасшифроватьВидео.Видимость = Ложь;
	
	Если Признак = Перечисления.ТипЭтапа.Видео Тогда
		Элементы.Видео.Видимость = Истина;
	ИначеЕсли Признак = Перечисления.ТипЭтапа.РасшифровкаВидео Тогда
		Элементы.РасшифровкаВидео.Видимость = Истина;
	ИначеЕсли Признак = Перечисления.ТипЭтапа.ОбработаннаяРасшифровка Тогда
		Элементы.ДетализацияРасшифровки.Видимость = Истина;
	КонецЕсли;
	
	Если Признак = Перечисления.ТипЭтапа.Видео Тогда
		Элементы.ФормаРасшифроватьВидео.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры
//Конец ВидимостьПолей

&НаКлиенте
Процедура РасшифроватьВидео(Команда)
	
	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Элемент должен быть записан.");
		возврат;
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(Объект.Видео) тогда
		РасшифроватьВидеоНаСервере();
	Иначе
		Сообщить("Заполните видео.");
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура РасшифроватьВидеоНаСервере()
	
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("Родитель",Объект.Ссылка); 
	Запрос.УстановитьПараметр("ТипЭтапа",Перечисления.ТипЭтапа.РасшифровкаВидео);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапыПроекта.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
	               |ГДЕ
	               |	ЭтапыПроекта.Родитель = &Родитель
	               |	И ЭтапыПроекта.ТипЭтапа = &ТипЭтапа";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		РасшифровкаВидеоОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
	Иначе
		
		РасшифровкаВидеоОбъект = Справочники.ЭтапыПроекта.СоздатьЭлемент();
		РасшифровкаВидеоОбъект.Родитель = Объект.Ссылка; 
		РасшифровкаВидеоОбъект.Наименование = "РасшифровкаВидео";
		РасшифровкаВидеоОбъект.Видео = Объект.Видео;
		РасшифровкаВидеоОбъект.ТипЭтапа = Перечисления.ТипЭтапа.РасшифровкаВидео;
		
	КонецЕсли;
	
	РасшифровкаВидеоОбъект.РасшифровкаВидео = РасшифроватьВидеоСервер.ПолучитьРасшифровкуВидео();
	РасшифровкаВидеоОбъект.Записать();   
	
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("Родитель",РасшифровкаВидеоОбъект.Ссылка); 
	Запрос.УстановитьПараметр("ТипЭтапа",Перечисления.ТипЭтапа.ОбработаннаяРасшифровка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапыПроекта.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
	               |ГДЕ
	               |	ЭтапыПроекта.Родитель = &Родитель
	               |	И ЭтапыПроекта.ТипЭтапа = &ТипЭтапа";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если не Выборка.Следующий() Тогда
		
		ОбработаннаяРасшифровкаОбъект = Справочники.ЭтапыПроекта.СоздатьЭлемент();
		ОбработаннаяРасшифровкаОбъект.Родитель = РасшифровкаВидеоОбъект.Ссылка;  
		ОбработаннаяРасшифровкаОбъект.Видео = Объект.Видео;   
		ОбработаннаяРасшифровкаОбъект.Наименование = "ОбработаннаяРасшифровка";
		ОбработаннаяРасшифровкаОбъект.ТипЭтапа = Перечисления.ТипЭтапа.ОбработаннаяРасшифровка;
		
		ОбработаннаяРасшифровкаОбъект.Записать();
			
	КонецЕсли;
	
КонецПроцедуры  


















