#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТипЭтапаПриИзменении(Элемент)
	
	Объект.ТЧДействия.Очистить();
	
	ТипЭтапаПриИзмененииНаСервере();
	
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыТЧТабличныеДанные
&НаКлиенте
Процедура ТЧТабличныеДанныеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТЧТабличныеДанныеПриОкончанииРедактированияНаСервере();
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ТипЭтапаПриИзмененииНаСервере()
	
	ТаблицаДействий = Справочники.ЭтапыПроекта.ПолучитьДействия(Объект.ТипЭтапа);
	
	Объект.ТЧДействия.Загрузить(ТаблицаДействий);
	
КонецПроцедуры

&НаСервере
Процедура ТЧТабличныеДанныеПриОкончанииРедактированияНаСервере()
	
	ТзТабличныеДанные = Объект.ТчТабличныеДанные.Выгрузить();
	
	Справочники.ЭтапыПроекта.ПересчитатьНумерациюТаблицы(ТзТабличныеДанные);
	
	Объект.ТЧТабличныеДанные.Загрузить(ТзТабличныеДанные);
	
	
	

КонецПроцедуры
#КонецОбласти



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ГиперссылкаФайлов = РаботаСФайлами.ГиперссылкаФайлов();
	ГиперссылкаФайлов.Размещение = "Файлы";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ГиперссылкаФайлов);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	//ВидимостьГруппаВидео(Объект.Родитель,Объект.ТипЭтапа);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры


// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)

	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);

КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

//ВидимостьПолей
//&НаСервере
//Процедура ВидимостьГруппаВидео(Родитель, Признак)
	
	//Элементы.Файл.Видимость = Ложь;
	//Элементы.ФормаРасшифроватьВидео.Видимость = Ложь;
	
	//Если Признак = Перечисления.ТипЭтапа.Видео Тогда
		//Элементы.Файл.Видимость = Истина;
	//КонецЕсли;
	
	//Если Признак = Перечисления.ТипЭтапа.Видео ИЛИ 
		 //Признак = Перечисления.ТипЭтапа.РасшифровкаВидео ИЛИ
		 //Признак = Перечисления.ТипЭтапа.ОбработаннаяРасшифровка	Тогда
		
		//Элементы.ФормаРасшифроватьВидео.Видимость = Истина;
		
	//КонецЕсли;
	
//КонецПроцедуры
//Конец ВидимостьПолей

&НаКлиенте
Процедура РасшифроватьВидео(Команда)
	
	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Элемент должен быть записан.");
		возврат;
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(Объект.Файл) тогда
		РасшифроватьВидеоНаСервере();
	Иначе
		Сообщить("Заполните Файл.");
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура РасшифроватьВидеоНаСервере()
	
	Справочники.ЭтапыПроекта.ВыполнитьДействие(Объект.ТипЭтапа, "КнопкаДействияРасшифровкаВидео", Объект);
	
КонецПроцедуры  


















