
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПутьКФайлу = "D:\"
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСервере()
	
	СоответствиеОбъекты = Новый Соответствие;
	СоответствиеОбъекты = ПолучитьСоответствие(СоответствиеОбъекты);
	
	ЗначениеВФайл(ПутьКФайлу + "ФайлВыгрузкиМетаданных.txt", СоответствиеОбъекты);

КонецПроцедуры




&НаСервере
Функция ПолучитьСоответствие(СоответствиеОбъекты)
	
	ВывестиМетаданные(СоответствиеОбъекты, Метаданные.Справочники, "Справочник");
	ВывестиМетаданные(СоответствиеОбъекты, Метаданные.Документы, "Документ");
		
	Возврат СоответствиеОбъекты;
	
КонецФункции


&НаСервере
Процедура ВывестиМетаданные(СоответствиеОбъекты, ВидМетаданных, ИмяВидаМетаданных)
	
	Для Каждого МетаданныеОбъект Из ВидМетаданных Цикл
		
		ТЧРеквизиты = Новый ТаблицаЗначений;
		ТЧРеквизиты.Колонки.Добавить("ИмяРеквизита");
		ТЧРеквизиты.Колонки.Добавить("ТипРеквизита");
		ТЧРеквизиты.Колонки.Добавить("Примечание"); 
		
		ТЧСтруктураТаблиц = Новый ТаблицаЗначений;
		ТЧСтруктураТаблиц.Колонки.Добавить("ИмяТаблицы");
		ТЧСтруктураТаблиц.Колонки.Добавить("Примечание");
		
		ТЧРеквизитыТаблиц = Новый ТаблицаЗначений;
		ТЧРеквизитыТаблиц.Колонки.Добавить("ИмяТаблицы");
		ТЧРеквизитыТаблиц.Колонки.Добавить("ИмяРеквизита");
		ТЧРеквизитыТаблиц.Колонки.Добавить("ТипРеквизита");
		ТЧРеквизитыТаблиц.Колонки.Добавить("Примечание");
		
		Соответствие = Новый Соответствие;
		Соответствие.Вставить("ТЧРеквизиты",ТЧРеквизиты);
		Соответствие.Вставить("ТЧСтруктураТаблиц",ТЧСтруктураТаблиц);
		Соответствие.Вставить("ТЧРеквизитыТаблиц",ТЧРеквизитыТаблиц);
		
		СоответствиеОбъекты.Вставить(ИмяВидаМетаданных + " """ + МетаданныеОбъект.Имя + """", Соответствие);   
		
		ВывестиКоллекциюМетаданных(Соответствие["ТЧРеквизиты"], МетаданныеОбъект.СтандартныеРеквизиты, "");
		ВывестиКоллекциюМетаданных(Соответствие["ТЧРеквизиты"], МетаданныеОбъект.Реквизиты, "");
		
		Для Каждого ТабличнаяЧасть Из МетаданныеОбъект.ТабличныеЧасти Цикл    
			
			Строка = Соответствие["ТЧСтруктураТаблиц"].Добавить();
			Строка.ИмяТаблицы = ТабличнаяЧасть.Имя;
			Строка.Примечание = СокрЛП(ТабличнаяЧасть.Комментарий + " " + ТабличнаяЧасть.Подсказка);
			
			ВывестиКоллекциюМетаданных(Соответствие["ТЧРеквизитыТаблиц"], ТабличнаяЧасть.Реквизиты, ТабличнаяЧасть.Имя); 
							
		КонецЦикла;  
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ВывестиКоллекциюМетаданных(Таблица, КоллекцияМетаданных, ИмяТаблицы)
	Для Каждого МетаданныеРеквизит Из КоллекцияМетаданных Цикл
		Если МетаданныеРеквизит.Имя <> "Ссылка" 
			И МетаданныеРеквизит.Имя <> "ПометкаУдаления" 
			И МетаданныеРеквизит.Имя <> "Предопределенный" 
			И МетаданныеРеквизит.Имя <> "Проведен" 
			Тогда 
			
				Строка = Таблица.Добавить();
				
				ЗаполнитьСтроку(Строка, МетаданныеРеквизит, ИмяТаблицы);
			
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтроку(Строка, МетаданныеРеквизит, ИмяТаблицы)
	
	Строка.ИмяРеквизита = ?(ПустаяСтрока(МетаданныеРеквизит.Синоним), МетаданныеРеквизит.Имя, МетаданныеРеквизит.Синоним);
	Строка.ТипРеквизита = ПолучитьСтрокуТипа(МетаданныеРеквизит.Тип);
	Строка.Примечание = СокрЛП(МетаданныеРеквизит.Комментарий + " " + МетаданныеРеквизит.Подсказка); 
	
	Если ЗначениеЗаполнено(ИмяТаблицы) Тогда
		Строка.ИмяТаблицы = ИмяТаблицы;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокуТипа(Тип)  
	
	СтрокаТипа = ""; 
	
	Для Каждого ЭкземплярТипа Из Тип.Типы() Цикл
		Если ЭкземплярТипа = Тип("Булево") ИЛИ ЭкземплярТипа = Тип("УникальныйИдентификатор")  Тогда //Новый ОписаниеТипов("Булево")
			Имя = СокрЛП(ЭкземплярТипа);
			ВидТипа = "";
		ИначеЕсли ЭкземплярТипа = Тип("Строка") Тогда
			Имя = СокрЛП(ЭкземплярТипа) + " " + ?(Тип.КвалификаторыСтроки.Длина = 0, "неогр.", СокрЛП(Тип.КвалификаторыСтроки.Длина));
			ВидТипа = "";
		ИначеЕсли ЭкземплярТипа = Тип("Число") Тогда
			Имя = СокрЛП(ЭкземплярТипа) + " " + Тип.КвалификаторыЧисла.Разрядность + ":" + Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти;
			ВидТипа = "";
		ИначеЕсли ЭкземплярТипа = Тип("Дата") Тогда
			Имя = СокрЛП(Тип.КвалификаторыДаты.ЧастиДаты);
			ВидТипа = "";
		ИначеЕсли ЭкземплярТипа = Тип("ХранилищеЗначения") Тогда
			Имя = "Бинарные данные";
			ВидТипа = "";
		Иначе
			Имя = СокрЛП(ЭкземплярТипа);
			Если Справочники.ТипВсеСсылки().СодержитТип(ЭкземплярТипа) Тогда
				ВидТипа = "Справочник";
			ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ЭкземплярТипа) Тогда
				ВидТипа = "Документ";
			ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ЭкземплярТипа) Тогда
				ВидТипа = "План видов характеристик";
			ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ЭкземплярТипа) Тогда
				ВидТипа = "Перечисление";
			Иначе
				ВидТипа = "<>";
			КонецЕсли;	
			
			Попытка
				Об = Новый(ЭкземплярТипа);
				Имя = Об.Метаданные().Имя;
			Исключение
			КонецПопытки;
		КонецЕсли;
		ПредставлениеТипа = "";
		Кавычка1 = "";
		Кавычка2 = "";
		Если ВидТипа = "<>" Тогда
			Кавычка1 = "<";
			Кавычка2 = ">";
		ИначеЕсли Не ПустаяСтрока(ВидТипа) Тогда
			Кавычка1 = """";
			Кавычка2 = """";
		КонецЕсли;	
			
		ПредставлениеТипа = СокрЛП(ВидТипа + " " + Кавычка1 + СокрЛП(Имя) + Кавычка2);
		СтрокаТипа = СокрЛП(СтрокаТипа) + ?(ПустаяСтрока(СтрокаТипа), "", "; ") + ПредставлениеТипа;
	КонецЦикла; 
	
	Возврат СтрокаТипа;
	
КонецФункции  





